#include <stdio.h>
int a, b, result;
<<<<<<< HEAD
int main_operator4()
=======
int main()
>>>>>>> aabe773d80ec25d5c61995e51c33e5ec2b4b2195
{
	int a = 15;  //00000000 00000000 00000000 00001111
	int b = 20;  //00000000 00000000 00000000 00010100

<<<<<<< HEAD
	int result = a & b; //a¿Í bÀÇ ºñÆ® & ¿¬»ê 
	// 00000000 00000000 00000000 00000100 
	// 2ÀÇ 0½Â*0 + 2ÀÇ 1½Â*0 + 2ÀÇ 2½Â*1 = 4
	// result´Â 4

	printf("ºñÆ® &¿¬»ê °á°ú: %d \n", result);
=======
	int result = a & b; //aì™€ bì˜ ë¹„íŠ¸ & ì—°ì‚° 
	// 00000000 00000000 00000000 00000100 
	// 2ì˜ 0ìŠ¹*0 + 2ì˜ 1ìŠ¹*0 + 2ì˜ 2ìŠ¹*1 = 4
	// resultëŠ” 4

	printf("ë¹„íŠ¸ &ì—°ì‚° ê²°ê³¼: %d \n", result);
>>>>>>> aabe773d80ec25d5c61995e51c33e5ec2b4b2195
	return 0;
}
